Repository: Opselon/SaloonOS
Catalog: SaloonOS.Api/Resources/SharedResources.*.resx
Languages: fa, ru

# WelcomeMessage
source: Welcome to SaloonOS! The system is operational.
fa: !به سالن او اس خوش آمدید! سیستم فعال است
ru: Добро пожаловать в SaloonOS! Система работает.

# ApiKeyMissing
source: API Key was not provided in the X-Api-Key header.
fa: کلید API در هدر X-Api-Key ارائه نشده است
ru: Ключ API не был предоставлен в заголовке X-Api-Key.

# ApiKeyInvalid
source: The provided API Key is invalid or does not correspond to an active tenant.
fa: کلید API ارائه شده نامعتبر است یا به یک سالن فعال تعلق ندارد
ru: Предоставленный ключ API недействителен или не соответствует активному арендатору.

# ShopNotFound
source: The requested shop could not be found.
fa: سالن درخواستی یافت نشد
ru: Запрошенный салон не найден.

# ForbiddenAccess
source: You are not authorized to access this resource.
fa: شما مجاز به دسترسی به این منبع نیستید
ru: У вас нет прав для доступа к этому ресурсу.

# ServiceNameRequired
source: Service name is required.
fa: نام سرویس الزامی است
ru: Название услуги обязательно.

# ServicePriceInvalid
source: Service price must be greater than zero.
fa: قیمت سرویس باید بیشتر از صفر باشد
ru: Цена услуги должна быть больше нуля.

# ServiceDurationInvalid
source: Service duration in minutes must be greater than zero.
fa: مدت زمان سرویس به دقیقه باید بیشتر از صفر باشد
ru: Продолжительность услуги в минутах должна быть больше нуля.

# ServiceCreatedSuccessfully
source: The service has been created successfully.
fa: سرویس با موفقیت ایجاد شد
ru: Услуга успешно создана.

# ServiceNotFound
source: The requested service could not be found within your shop.
fa: سرویس درخواستی در سالن شما یافت نشد
ru: Запрошенная услуга не найдена в вашем салоне.

# ServiceUpdatedSuccessfully
source: The service has been updated successfully.
fa: سرویس با موفقیت به روز رسانی شد
ru: Услуга успешно обновлена.

# ServiceDeletedSuccessfully
source: The service has been successfully deleted.
fa: سرویس با موفقیت حذف شد
ru: Услуга успешно удалена.

# StaffMemberNameRequired
source: Staff member name is required.
fa: نام پرسنل الزامی است
ru: Имя сотрудника обязательно.

# StaffMemberCreated
source: Staff member has been successfully added to your shop.
fa: پرسنل با موفقیت به سالن شما اضافه شد
ru: Сотрудник успешно добавлен в ваш салон.

# BusinessCategoryRequired
source: Please select a business category for your shop.
fa: لطفا یک دسته بندی تجاری برای سالن خود انتخاب کنید
ru: Пожалуйста, выберите категорию бизнеса для вашего салона.

# PaymentAmountInvalid
source: Payment amount must be a positive value.
fa: مبلغ پرداخت باید یک مقدار مثبت باشد
ru: Сумма платежа должна быть положительным значением.

# PaymentTokenInvalid
source: The provided payment token is invalid or has expired.
fa: توکن پرداخت ارائه شده نامعتبر است یا منقضی شده
ru: Предоставленный платежный токен недействителен или истек.

# PaymentSuccessful
source: Payment was processed successfully.
fa: پرداخت با موفقیت انجام شد
ru: Платеж успешно обработан.

# PaymentFailed
source: Payment processing failed. Please check your details and try again.
fa: پردازش پرداخت ناموفق بود. لطفا اطلاعات خود را بررسی کرده و دوباره تلاش کنید
ru: Обработка платежа не удалась. Пожалуйста, проверьте свои данные и попробуйте снова.

# AppointmentServiceSelectionPrompt
source: Please select your desired service:
fa: لطفا سرویس مورد نظر خود را انتخاب کنید:
ru: Пожалуйста, выберите желаемую услугу:

# AppointmentStaffSelectionPrompt
source: Please select your preferred staff member (or choose 'Any Available'):
fa: لطفا آرایشگر مورد نظر خود را انتخاب کنید (یا 'هرکدام آزاد بود' را انتخاب کنید):
ru: Пожалуйста, выберите предпочитаемого мастера (или выберите 'Любой свободный'):

# AppointmentDaySelectionPrompt
source: Please select a day for your appointment:
fa: لطفا یک روز برای نوبت خود انتخاب کنید:
ru: Пожалуйста, выберите день для вашей записи:

# AppointmentTimeSlotSelectionPrompt
source: Please select an available time for {0} on {1}:
fa: لطفا یک زمان خالی برای {0} در تاریخ {1} انتخاب کنید:
ru: Пожалуйста, выберите доступное время для {0} на {1}:

# AppointmentConfirmationPrompt
source: Please confirm your appointment details:\n\nService: {0}\nStaff: {1}\nDate: {2}\nTime: {3}\nPrice: {4}\n\nIs this correct?
fa: لطفا جزئیات نوبت خود را تایید کنید:\n\nسرویس: {0}\nپرسنل: {1}\nتاریخ: {2}\nساعت: {3}\nقیمت: {4}\n\nآیا صحیح است؟
ru: Пожалуйста, подтвердите детали вашей записи:\n\nУслуга: {0}\nМастер: {1}\nДата: {2}\nВремя: {3}\nЦена: {4}\n\nВсе верно?

# AppointmentBookedSuccessfully
source: âœ… Your appointment is confirmed! We look forward to seeing you.
fa: ✅ نوبت شما تایید شد! مشتاقانه منتظر دیدار شما هستیم.
ru: ✅ Ваша запись подтверждена! С нетерпением ждем вас.

# TimeSlotNotAvailable
source: Sorry, that time slot is no longer available. Please select another time.
fa: متاسفانه، این بازه زمانی دیگر در دسترس نیست. لطفا زمان دیگری را انتخاب کنید.
ru: К сожалению, это время больше недоступно. Пожалуйста, выберите другое время.

# NoAvailableSlots
source: Sorry, there are no available time slots for the selected day. Please try another day.
fa: متاسفانه، هیچ بازه زمانی خالی برای روز انتخاب شده وجود ندارد. لطفا روز دیگری را امتحان کنید.
ru: К сожалению, на выбранный день нет свободных мест. Пожалуйста, попробуйте другой день.

# ConfirmButton
source: Confirm
fa: تایید
ru: Подтвердить

# CancelButton
source: Cancel
fa: لغو
ru: Отмена

# MyAppointmentsTitle
source: Your Upcoming Appointments:
ru: Ваши предстоящие записи:

# NoUpcomingAppointments
source: You have no upcoming appointments scheduled.
ru: У вас нет запланированных записей.

# AppointmentCancelledSuccessfully
source: Your appointment has been successfully cancelled.
ru: Ваша запись была успешно отменена.

# CannotCancelAppointment
source: This appointment cannot be cancelled (it may be in the past or already completed).
ru: Эту запись нельзя отменить (возможно, она уже прошла или была завершена).

# AppointmentNotFound
source: The specified appointment could not be found or does not belong to you.
ru: Указанная запись не найдена или не принадлежит вам.

# CancelAppointmentButton
source: Cancel This Appointment
ru: Отменить эту запись

# AdminDailyScheduleTitle
source: Schedule for {0}:
ru: Расписание на {0}:

# AdminNotAuthorized
source: You are not authorized to perform this administrative action.
ru: У вас нет прав для выполнения этого административного действия.

# AppointmentDetails
source: {0} - {1} with {2} for {3}
ru: {0} - {1} с {2} для {3}
